{
  "meniu.home": "Acasă",
  "meniu.about": "Despre",
  "meniu.experience": "Experiență",
  "meniu.portfolio": "Portofoliu",
  "meniu.github": "GitHub-ul meu",
  "meniu.contact": "Contact",
  "ab.name": "Nume: ",
  "ab.prof": "Profil: ",
  "ab.phone": "Telefon: ",
  "ab.skill": "Competențe",
  "ab.abt": "Despre mine",
  "ab.para1": "Dezvoltator JavaScript cu experiență în proiecte Smart City și cunoștințe pe întregul stack de dezvoltare web. Specializat în construirea de aplicații web responsive folosind JavaScript, TypeScript, HTML, CSS/SCSS și framework-uri precum React, Vue și AngularJS.",
  "ab.para2": "Competent în dezvoltare backend cu Node.js și SQL, inclusiv proiectarea și consumarea de API-uri REST, implementarea validărilor și aplicarea principiilor OOP și TDD. Experiență în testare unitară (Jest) și utilizarea tool-urilor frontend (Webpack, Vite, Gulp) pentru a asigura cod scalabil și ușor de întreținut.",
  "ab.para3": "Instrumentele și practicile utilizate includ Git/GitHub, metodologii Scrum și Figma, susținând un proces de dezvoltare eficient și o colaborare bine structurată.",
  "exp.work": "Experiență profesională",
  "exp.job3": "Visual Merchandiser",
  "exp.data3": "Octombrie 2021 - Noiembrie 2024",
  "exp.work3": "Oferirea de suport clienților prin recomandări personalizate, optimizarea și organizarea spațiilor de expunere conform standardelor vizuale, planogramelor și tendințelor, pentru evidențierea produselor, promoțiilor și noilor colecții.",
  "exp.education": "Educație",
  "exp.it": "Cursuri IT",
  "exp.data4": "Noiembrie 2024 - Septembrie 2025",
  "exp.frontend": "Dezvoltare Frontend JavaScript",
  "exp.bachelor": "Diplomă de licență",
  "exp.data6": "Octombrie 2022 - Iulie 2025",
  "exp.university2": "Universitatea din București",
  "exp.univ2": "Comunicare și Relații Publice",
  "exp.certification": "Certificări",
  "exp.js": "Dezvoltator JavaScript certificat",
  "exp.data10": "Noiembrie 2024 - Septembrie 2025",
  "exp.fullstack": "Dezvoltare Frontend JavaScript",
  "exp.management": "Certificat diplomă de licență",
  "exp.data7": "Iulie 2025",
  "exp.manager": "Comunicare și Relații Publice",
  "port.portofolio": "Portofoliu",
  "port.projects": "Cele mai recente proiecte realizate",
  "proj2.title": "CV-ul meu",
  "proj2.para1": "CV-ul meu online, construit ca o aplicație single-page pentru a prezenta proiectele, competențele și parcursul meu în dezvoltarea frontend.",
  "proj2.para2": "Dezvoltat folosind HTML, CSS și JavaScript, cu accent pe structură responsive, claritate și accesibilitate pentru utilizatori.",
  "proj2.para3": "Proiectul integrează și Bootstrap pentru flexibilitatea layout-ului și Webpack pentru managementul resurselor și optimizarea procesului de build.",
  "proj3.title": "One-Pager",
  "proj3.para1": "Acesta este un website de tip one-page construit cu HTML, CSS și Bootstrap, conceput pentru a evidenția un layout responsive. Proiectul include un logo personalizat, un banner video pe tot ecranul, animații realizate cu AOS și funcționalitate de dark mode.",
  "proj3.para2": "<strong>Funcționalități cheie implementate:</strong>",
  "proj3.para3": "Layout responsive folosind sistemul de grid Bootstrap",
  "proj3.para4": "Integrare logo personalizat și favicon",
  "proj3.para5": "Video de fundal full-width în secțiunea hero",
  "proj3.para6": "Animații bazate pe scroll cu AOS",
  "proj3.para7": "Navigare fluidă pe secțiuni și header sticky",
  "proj3.para8": "Funcționalitate de dark mode",
  "proj3.para9": "Formular de contact și Google Maps integrat",
  "proj3.para10": "Structură modulară: Despre, Servicii, Portofoliu, Testimoniale, Contact",
  "proj3.para11": "Structura este completă, iar conținutul vizual (text/imagine) este încă în curs de rafinare. Acesta este al doilea meu proiect de tip full-layout, axat pe complexitate, experiența utilizatorului și coerența designului.",
  "proj3.para12": "<a href=\"https://mihaelaraducu.github.io/proiectcss/\" target=\"_blank\" style=\"text-decoration: underline; font-weight: bold;\" aria-label=\"Vezi proiectul live pentru proiectul CSS\">Vezi proiectul live</a>",
  "proj1.title1": "Drumul Frontend",
  "proj1.para1": "Acest roadmap oferă o imagine clară asupra pașilor esențiali pentru a deveni Frontend Developer. Este un ghid structurat pentru cei care doresc să urmeze o carieră în dezvoltarea web, dar nu știu de unde să înceapă sau cum să-și organizeze parcursul de învățare.",
  "port.para2": "<strong>Pași cheie acoperiți:</strong>",
  "proj1.para3": "Învață bazele: HTML, CSS și JavaScript",
  "proj1.para4": "Explorează framework-uri și librării moderne precum React, Vue.js sau Angular",
  "proj1.para5": "Exersează constant prin proiecte personale și provocări de programare",
  "proj1.para6": "Fii la curent cu tendințele din industrie și continuă să înveți",
  "proj1.para7": "Construiește un portofoliu care să îți evidențieze abilitățile",
  "proj1.para8": "Conectează-te cu comunitatea de dezvoltatori și tech",
  "proj1.para9": "Pentru o prezentare mai detaliată, inclusiv designul complet și resurse utile, poți consulta postarea de pe LinkedIn: <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7303037542184939522/\" target=\"_blank\" style=\"text-decoration: underline; font-weight: bold;\" aria-label=\"Vezi postarea mea de pe LinkedIn despre proiectul Frontend Path\">Vezi postarea pe LinkedIn</a>",
  "proj4.title": "Showcase de design",
  "proj4.para1": "Acest mockup creativ a fost realizat pentru a ilustra layout-uri moderne și responsive pe diferite dispozitive. Deși nu este un website funcțional, evidențiază principii esențiale de design precum echilibrul, spațiul alb, ierarhia vizuală și tipografia.",
  "proj5.title": "Călătoria Frontend",
  "proj5.para1": "Această piesă vizuală reprezintă un moment-cheie din începuturile mele ca dezvoltator frontend. După construirea primului meu website responsive folosind HTML și CSS, am început să mă concentrez mai profund pe structura layout-ului, sistemele de design și comportamentul responsive pe diferite dispozitive.",
  "proj5.para2": "Deși nu este un proiect funcțional, acest mockup surprinde tranziția de la o implementare pur tehnică la un design mai gândit și intenționat. Reflectă o etapă importantă în care am început să conectez execuția tehnică cu experiența utilizatorului și claritatea vizuală.",
  "proj5.para3": "Această etapă a marcat începutul unei abordări mai strategice în modul în care îmi planific, structurez și prezint munca.",
  "proj6.title": "Website responsive",
  "proj6.para1": "Acest proiect reprezintă primul meu pas în dezvoltarea frontend, concentrându-se pe construirea unui website static complet responsive folosind doar HTML și CSS. Mi-a permis să aplic principiile de bază ale layout-ului web, structurii și designului responsive.",
  "proj6.para2": "<strong>Zone cheie de focus:</strong>",
  "proj6.para3": "Structură HTML semantică pentru claritate și accesibilitate",
  "proj6.para4": "Stilizare CSS cu accent pe ierarhia vizuală și layout",
  "proj6.para5": "Design responsive folosind media queries și unități flexibile",
  "proj6.para6": "Layout optimizat pentru mai multe dimensiuni de ecran",
  "proj6.para7": "Acest proiect a marcat începutul parcursului meu în dezvoltarea frontend. M-a ajutat să înțeleg cum structura și stilul lucrează împreună pentru a crea experiențe accesibile și ușor de utilizat pe toate dispozitivele.",
  "proj6.para8": "<a href=\"https://mihaelaraducu.github.io/html-css-project/\" target=\"_blank\" style=\"text-decoration: underline; font-weight: bold;\" aria-label=\"Vezi proiectul live pentru proiectul HTML și CSS\">Vezi proiectul live</a>",
  "git.repo": "Repository-ul meu GitHub",
  "git.hub": "Cel mai recent repository GitHub",
  "ct.message": "Trimite-mi un mesaj",
  "ct.send": "Trimite mesajul",
  "ct.title": "Vrei să colaborăm?",
  "ct.inf": "Indiferent dacă ai nevoie de ajutor pentru un proiect frontend, construiești o echipă de dezvoltare web sau dorești să implementezi soluții tehnologice moderne, sunt deschis oportunităților de colaborare!<br>Te invit să completezi formularul sau să îmi trimiți un email.<br>Aștept cu interes să discutăm despre posibile colaborări și să contribuim împreună la proiecte de impact.",
  "typed": "Programator, Dezvoltator, Freelancer, Gamer",
  "ct.place.name": "Nume",
  "ct.place.email": "Email-ul tău",
  "ct.place.subject": "Subiect",
  "ct.place.message": "Mesaj",
  "ft.credits": "Proiect realizat de <a href=\"#\">Pisica-Grigore Alexandru-Stefan</a>",
  "ft.copy": "<span>&copy;</span> Drepturi de autor <strong>Pisica-Grigore Alexandru-Stefan</strong>. Toate drepturile rezervate"
}
